In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

# Series reindex

In [5]:
s1 = Series([1,2,3,4],index=['A','B','C','D'])

In [6]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [7]:
s1.reindex(index=['A','B','C','D','E'])

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
dtype: float64

In [8]:
s1.reindex(index=['A','B','C','D','E'],fill_value=10)

A     1
B     2
C     3
D     4
E    10
dtype: int64

In [9]:
s2 = Series(['A','B','C'],index=[1,5,10])

In [10]:
s2

1     A
5     B
10    C
dtype: object

In [15]:
s2.reindex(index=range(15),method='ffill')

0     NaN
1       A
2       A
3       A
4       A
5       B
6       B
7       B
8       B
9       B
10      C
11      C
12      C
13      C
14      C
dtype: object

# Reindex dataframe

In [19]:
df1 = DataFrame(np.random.rand(25).reshape([5,5]),index=['A','B','D','E','F'],columns=['c1','c2','c3','c4','c5'])

In [20]:
df1

         c1        c2        c3        c4        c5
A  0.128893  0.740257  0.672557  0.573581  0.470671
B  0.662814  0.318909  0.478582  0.556357  0.017382
D  0.728422  0.513657  0.031516  0.108787  0.717922
E  0.877277  0.902292  0.997289  0.711235  0.275391
F  0.126923  0.140703  0.711139  0.270429  0.914972

In [21]:
df1.reindex(index=['A','B','C','D','E','F'])

         c1        c2        c3        c4        c5
A  0.128893  0.740257  0.672557  0.573581  0.470671
B  0.662814  0.318909  0.478582  0.556357  0.017382
C       NaN       NaN       NaN       NaN       NaN
D  0.728422  0.513657  0.031516  0.108787  0.717922
E  0.877277  0.902292  0.997289  0.711235  0.275391
F  0.126923  0.140703  0.711139  0.270429  0.914972

In [22]:
df1.reindex(columns=['c1','c2','c3','c4','c5','c6'])

         c1        c2        c3        c4        c5  c6
A  0.128893  0.740257  0.672557  0.573581  0.470671 NaN
B  0.662814  0.318909  0.478582  0.556357  0.017382 NaN
D  0.728422  0.513657  0.031516  0.108787  0.717922 NaN
E  0.877277  0.902292  0.997289  0.711235  0.275391 NaN
F  0.126923  0.140703  0.711139  0.270429  0.914972 NaN

In [23]:
df1.reindex(index=['A','B','C','D','E','F'],columns=['c1','c2','c3','c4','c5','c6'])

         c1        c2        c3        c4        c5  c6
A  0.128893  0.740257  0.672557  0.573581  0.470671 NaN
B  0.662814  0.318909  0.478582  0.556357  0.017382 NaN
C       NaN       NaN       NaN       NaN       NaN NaN
D  0.728422  0.513657  0.031516  0.108787  0.717922 NaN
E  0.877277  0.902292  0.997289  0.711235  0.275391 NaN
F  0.126923  0.140703  0.711139  0.270429  0.914972 NaN

In [24]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [25]:
s1.reindex(index=['A','B'])

A    1
B    2
dtype: int64

In [26]:
df1.reindex(index=['A','B'])

         c1        c2        c3        c4        c5
A  0.128893  0.740257  0.672557  0.573581  0.470671
B  0.662814  0.318909  0.478582  0.556357  0.017382

In [27]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [28]:
s1.drop('A')

B    2
C    3
D    4
dtype: int64

In [29]:
df1

         c1        c2        c3        c4        c5
A  0.128893  0.740257  0.672557  0.573581  0.470671
B  0.662814  0.318909  0.478582  0.556357  0.017382
D  0.728422  0.513657  0.031516  0.108787  0.717922
E  0.877277  0.902292  0.997289  0.711235  0.275391
F  0.126923  0.140703  0.711139  0.270429  0.914972

In [30]:
df1.drop('A',axis=0)

         c1        c2        c3        c4        c5
B  0.662814  0.318909  0.478582  0.556357  0.017382
D  0.728422  0.513657  0.031516  0.108787  0.717922
E  0.877277  0.902292  0.997289  0.711235  0.275391
F  0.126923  0.140703  0.711139  0.270429  0.914972

In [32]:
df1.drop('c1',axis=1)

         c2        c3        c4        c5
A  0.740257  0.672557  0.573581  0.470671
B  0.318909  0.478582  0.556357  0.017382
D  0.513657  0.031516  0.108787  0.717922
E  0.902292  0.997289  0.711235  0.275391
F  0.140703  0.711139  0.270429  0.914972